
{
    "maliganant": {
        "Does the lesion range in color from red to brown?": "yes",
        "Is the color of the lesion unevenly distributed?": "yes",
        "Are there any crust formations on the skin?": "no",
        "Are there signs of blue-black or bluish discoloration in the lesion?": "yes",
        "Does the lesion appear translucent?": "no",
        "Is the lesion reddish to purplish in color?": "no",
        "Does the lesion have a visibly smooth and even surface?": "no",
        "Is there raised areas or nodules within the lesion?": "yes",
        "Does the lesion appear as a well-demarcated ring or crescent shape?": "no",
        "Does the discoloration of the skin lesion appear to be black, dark brown, or bluish?": "yes",
        "Is the lesion located on the face or neck?": "no",
        "Is the lesion ulcerated or broken skin surface?": "yes",
        "Is the lesion thickened with a central core?": "no",
        "Is the lesion deeply red or purple in color?": "no",
        "Are blood vessels visible within the lesion?": "no",
        "Has the lesion changed in size, shape, or color recently?": "yes",
        "Are irregular streaks radiating or spreading from the lesion?": "yes",
        "Does the lesion have discernible margins?": "yes",
        "Is there a crust formation over the lesion?": "no",
        "Does the lesion have a central keratin plug?": "no",
        "Does the lesion present as a thick, scaly, or crusty skin area?": "yes",
        "Is the lesion flat or sessile in nature?": "no",
        "Does the lesion appear to have a thin yellow halo around it?": "no",
        "Is the lesion changing in color?": "yes",
        "Does the lesion include crust formation?": "no",
        "Does the skin lesion look like flattened compared to surrounding normal skin?": "no",
        "Is the lesion located in the extremities, chest, neck, abdomen, or pelvis?": "yes",
        "Does the skin texture within the lesion appear different than the surrounding skin?": "yes",
        "Is the lesion single or multiple?": "no",
        "Is there a variation in color within the lesion?": "yes",
        "Is there an asymmetrical distribution of the lesion?": "yes",
        "Does the skin around the lesion look different than the rest of the body?": "yes",
        "Does the lesion show residual pigmentation?": "no",
        "Is the skin lesion irregularly bordered?": "yes",
        "Does the lesion appear similar to multiple lesions?": "no",
        "Is the color uniform throughout the lesion?": "no",
        "Do the lesions present as patches with an irregular shape?": "yes",
        "Is there any change in the sensation of the lesion, such as itching or pain?": "yes",
        "Are there satellite lesions (small lesions around the main one)?": "no",
        "Can we observe any oozing or bleeding from the lesion?": "yes",
        "Does the lesion differ from a convex object?": "yes",
        "Does the lesion have an atypical form?": "yes",
        "Does the lesion appear on the trunk?": "no",
        "Are the lesions arranged in a specific shape or pattern?": "no",
        "Does the lesion display variegated colors?": "yes",
        "Does the lesion have a translucent, glassy texture?": "no",
        "Are there any redness or swelling beyond the border of the mole?": "yes",
        "Do the lesions have an erythematous nature?": "no",
        "Is the lesion ulcerated?": "yes",
        "Is the lesion less than or equal to one centimeter in diameter?": "no",
        "Is the lesion located on the lower extremities?": "no",
        "Does the diameter of the lesion exceed 6mm?": "yes",
        "Is the lesion blue or white in color?": "no",
        "Does the lesion have a crust-like appearance?": "no",
        "Does the lesion display symptoms of superficial tumor-related telangiectasias?": "yes",
        "Is there a loss of uniform pigmentation in the lesion?": "yes",
        "Does the lesion show signs of inflammation or redness?": "yes",
        "Does the lesion have a rounded surface?": "no",
        "Is there an alteration or loss of skin lines within the lesion?": "yes",
        "Does the lesion have a yellow brown color?": "no",
        "Are there irregularities in the skin texture around the lesion?": "yes",
        "Is there a significant color difference between the lesion and the surrounding skin?": "yes",
        "Is the skin lesion ulcerative?": "no",
        "Does the skin lesion have varying color patterns?": "yes",
        "Does the size of the lesion exceed 6mm in diameter?": "yes",
        "Are black dots present on the surface of the plaque?": "yes",
        "Is the lesion located on the leg below the knee?": "no",
        "Is there a rapid development or change in the lesion over time?": "yes",
        "Is the lesion smooth?": "no",
        "Does the lesion show signs of blackish brown coloring?": "yes",
        "Are there varying shades within the lesion?": "yes",
        "Is the skin lesion brown or black-colored?": "yes",
        "Does the lesion present with irregular streaks?": "yes",
        "Does the lesion have a blue-black or greyish component?": "yes",
        "Does the lesion appear black?": "yes",
        "Does the lesion have a central depression or crusting?": "no",
        "Does the lesion exhibit an erythematous or flesh-colored appearance?": "no",
        "Does the lesion exhibit irregular prominence of pigmentation?": "yes",
        "Are there multiple shades of brown or black in the lesion?": "yes",
        "Is the skin on the surface of the lesion scaly?": "no",
        "Is the skin lesion flat and uniformly brown in color?": "no",
        "Is the color of the lesion uniform?": "no",
        "Are satellite spots present around the lesion?": "yes",
        "Is the lesion visibly streaked?": "no",
        "Is the lesion a flat or depressed type with a diameter of less than 10 mm?": "no",
        "Does the lesion have an elevation or an uneven surface?": "yes",
        "Is the lesion multicolored or colorless?": "yes",
        "Does the lesion have a distinct, different color from the surrounding skin?": "yes",
        "Is the lesion elevated, or has a slightly raised red margin?": "yes",
        "Do the skin abnormalities include small white or lighter patches of skin?": "no",
        "Does the lesion appear macular (flat) or papular (elevated)?": "no",
        "Does the lesion have a red color?": "yes",
        "Does the lesion have atypical networks or blue-whitish veils visible?": "yes",
        "Does the lesion have an irregular shape or form?": "yes",
        "Is the lesion border clear-cut?": "no",
        "Is there any overlying skin discoloration, possibly reddish-brown or tan-pink?": "yes",
        "Is the lesion elevated or raised?": "yes",
        "Does the lesion show various shades of grey, red, purple, or areas of depigmentation?": "yes",
        "Does the lesion have a flat or rounded surface?": "no",
        "Are more than one type of skin lesion observed such as macules, papules, bullae, or nodules?": "yes",
        "Does the lesion have pigmentation?": "yes",
        "Does the lesion show central ulceration-crust?": "no",
        "Is the lesion color predominantly golden-brown?": "no",
        "Is the lesion solid?": "yes",
        "Is the lesion solitary or multiple?": "no",
        "Are there black or brown streaks coming off the lesion?": "yes",
        "Does the skin present signs of sun sensitivity including burns, bumps or erythema?": "no",
        "Are there satellite moles around the lesion?": "yes",
        "Does the skin appear erythematous over the lesion?": "yes",
        "Does the lesion display prominent dark brown lines?": "no",
        "Is the margin of the lesion very distinct?": "yes",
        "Are the lesions raised?": "yes",
        "Is the lesion present on exposed skin?": "yes",
        "Is the lesion characterized by an erythematous indurated plaque?": "no",
        "Is the lesion multicolored with black, brown, red, or blue areas?": "yes",
        "Does the lesion appear to have a three-dimensional structure, instead of flat?": "yes",
        "Does the lesion have raised edges and a center crust?": "yes",
        "Are the lesions flat-topped?": "no",
        "Does the lesion have jagged borders?": "yes",
        "Are there inconsistencies or color changes present in the lesion?": "yes",
        "Does the lesion appear shiny or glossy in the digital image?": "no",
        "Are there any satellite moles around the lesion?": "yes",
        "Is the skin lesion deep-seated, round, and well-circumscribed?": "no",
        "Is the lesion gray-blue in color?": "no",
        "Does the lesion present as a growth that often causes ulcers?": "yes",
        "Does the lesion have an abrupt border end?": "yes",
        "Is the lesion unilocular in appearance?": "no",
        "Does the lesion exhibit color variation?": "yes",
        "Are there dense and sparse nests of cells in the lesion?": "yes",
        "Does the lesion texture look like hyperkeratosis?": "no",
        "Is there a gradual, radial pigment fading at the lesion's periphery?": "yes",
        "Does the lesion have a part that appears shiny or waxy?": "yes",
        "Does the lesion appear without any clinical pigmentation?": "no",
        "Does the lesion appear as a raised, hyperkeratotic papule on exposed skin surfaces?": "no",
        "Does the lesion show atypical pigment network?": "yes",
        "Does the lesion appear shinier than surrounding skin?": "no",
        "Does the lesion appear darker than the surrounding skin?": "yes",
        "Is there any ulceration in the lesion?": "yes",