
{
    "Lung Opacity": {
        "Can mediastinum shifting be observed on the chest X-ray?": "yes",
        "Is there a solitary pulmonary nodule smaller than three centimeters in diameter?": "no",
        "Are there indications of volume loss in the lung?": "yes",
        "Is there pleural effusion?": "yes",
        "Are multiple patchy shadows visible in both lungs?": "yes",
        "Are the lung markings diminished or absent?": "no",
        "Are there potential pleural effusions as viewed from lateral decubitus positions?": "yes",
        "Is heart displacement observed?": "no",
        "Are there alveolar opacities visible in the X-ray?": "yes",
        "Is there significant increase in vascular markings?": "yes",
        "Is the lung field darkened?": "yes",
        "Is there a shift of structures within the thorax?": "no",
        "Are there horizontal lines present on the chest x-ray?": "yes",
        "Is the cardiac silhouette rounded?": "no",
        "Is there symmetry in the chest abnormality?": "no",
        "Is there an increase in the combined mass of cardiac chambers visible?": "no",
        "Are there any visible signs of mediastinal adenopathy?": "no",
        "Can the lung borders be clearly seen?": "no",
        "Are there new alveolar opacities?": "yes",
        "Are both costophrenic angles clearly visible?": "no",
        "Does the chest X-ray reveal a very prominent pulmonary vascular pattern extending to the periphery of the lungs?": "yes",
        "Are there cavities filled with air or fluid in the lungs?": "yes",
        "Are the diaphragmatic contours abnormal?": "yes",
        "Are the bronchovascular markings distorted?": "yes",
        "Are there absent lung markings?": "no",
        "Is there a prominent pulmonary artery visible?": "yes",
        "Is there lung tissue squeezed between the heart and the inferior border?": "yes",
        "Is one lung field darker than the other?": "yes",
        "Can a substance that attenuates X-rays be identified?": "yes",
        "Can respiratory distress findings be observed on the chest X-ray?": "yes",
        "Are there changes in chest X-ray appearance that develop slowly?": "yes",
        "Is there any peribronchial thickening present?": "yes",
        "Are there any areas of increased density in the lung fields?": "yes",
        "Does the patient have small, irregular parenchymal opacities?": "yes",
        "Are there signs of rib deformation or chest wall abnormalities?": "no",
        "Are there diffuse alveolar opacities?": "yes",
        "Is bronchial wall thickening present?": "yes",
        "Are there anterior subpleural consolidations?": "yes",
        "Is the chest expansion reduced on one side?": "yes",
        "Is there a segmental consolidation observed?": "yes",
        "Are the pulmonary vasculature in both lungs appearing dilated?": "no",
        "Are signs of airspace consolidation, more specifically in a subpleural region, present?": "yes",
        "Is there an increase in the density of lung fields?": "yes",
        "Are nodular infiltrates visible on the chest X-ray?": "yes",
        "Are there signs of collapse or consolidation in the lung?": "yes",
        "Is excessive air in the esophagus visible?": "no",
        "Can you observe enlargement of hilar structures?": "yes",
        "Is there an absence of lung markings?": "no",
        "Does the X-ray indicate an obvious mass?": "yes",
        "Can ground glass or consolidative opacities be observed in the X-ray?": "yes",
        "Can ground glass like changes be observed?": "yes",
        "Is there evidence of elevated hilar structures?": "no",
        "Do lung lobes appear collapsed?": "no",
        "Can foreign material or objects be seen in the bronchus?": "no",
        "Is the heart or mediastinum abnormally positioned?": "no",
        "Are there signs of prominent or dilated pulmonary artery?": "no",
        "Are there calcifications indicated in the X-ray?": "no",
        "Is there fluid in the lungs?": "yes",
        "Can an abnormal mass be identified on a chest X-ray?": "yes",
        "Is there a visible enlargement of the heart?": "no",
        "Is there any evidence of fluid in the pleural space?": "yes",
        "Are pulmonary vessels engorged?": "yes",
        "Are lung fields clear on both sides?": "no",
        "Are the bronchial walls thickened?": "yes",
        "Are there any signs of localized vascular abnormalities in the chest?": "yes",
        "Are there signs of pulmonary fibrosis or granulomas?": "no",
        "Is there evidence of linear and reticular abnormalities in lower lungs?": "yes",
        "Is there observable apical scarring?": "yes",
        "Can nodular densities be seen in the chest x-ray?": "yes",
        "Does the trachea appear shifted?": "yes",
        "Are the lung volumes reduced?": "no",
        "Are there indications of lung volume loss on one side?": "no",
        "Are there linear opacities at the lung bases?": "yes",
        "Is there a lesion present in the lung?": "yes",
        "Is there an abnormal aortic contour visible?": "no",
        "Is there interstitial infiltrates visible on the chest x-ray?": "yes",
        "Is there any visually noticeable change in the wideness of the mediastinum?": "no",
        "Are pleural effusions present?": "yes",
        "Are there primary opacities observed?": "yes",
        "Is there noticeable tracheal shift?": "no",
        "Is there evidence of lung hyperinflation?": "no",
        "Is there an opacification of the aortopulmonary window?": "yes",
        "Does the chest X-ray show pleural effusions?": "no",
        "Is there presence of Kerley B-lines?": "yes",
        "Are there reticular opacities present?": "yes",
        "Is the trachea deviated?": "no",
        "Are hilar structures enlarged?": "yes",
        "Is there any abnormal lung shadowing?": "yes",
        "Is there a radiolucent area of air in the lung field?": "yes",
        "Does the lung field exhibit patchy infiltrates?": "yes",
        "Does the lung display a plate-like appearance?": "yes",
        "Is the mediastinal shift present?": "no",
        "Is there poor distinction of the diaphragm?": "yes",
        "Does pleural effusion appear on the X-ray?": "no",
        "Is there presence of pleural thickening?": "yes",
        "Is peripheral lung field clear?": "no",
        "Is there increased interstitial density?": "yes",
        "Does the chest X-ray show signs of pneumonia?": "no",
        "Is there an increase in the pulmonary artery silhouette?": "yes",
        "Can a lung edge be identified?": "yes",
        "Do diffuse bilateral infiltrates appear on the X-ray?": "yes",
        "Is there evidence of free air at the diaphragm?": "no",
        "Is there pleural thickening?": "yes",